vmux0.0.10-pre/hotelReservation_bridge_19vms_8rps_rep1.log
Running 1m test @ http://10.1.0.21:5000
  8 threads and 16 connections

  Thread calibration: mean lat.: 9.752ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 9.068ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 10.218ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 6.578ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 8.192ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 11.093ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 7.400ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 6.972ms, rate sampling interval: 27ms

-----------------------------------------------------------------------
Test Results @ http://10.1.0.21:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.48ms    4.64ms  18.38ms   71.76%
    Req/Sec     1.08      6.99    38.00     97.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.92ms
 75.000%   11.99ms
 90.000%   14.81ms
 99.000%   18.38ms
 99.900%   20.86ms
 99.990%   20.86ms
 99.999%   20.86ms
100.000%   20.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.930     0.000000            1         1.00
       3.359     0.100000           44         1.11
       3.641     0.200000           87         1.25
       3.845     0.300000          130         1.43
       4.963     0.400000          173         1.67
       5.923     0.500000          216         2.00
       6.099     0.550000          238         2.22
       6.291     0.600000          260         2.50
       6.459     0.650000          281         2.86
       8.479     0.700000          303         3.33
      11.991     0.750000          324         4.00
      12.743     0.775000          335         4.44
      13.215     0.800000          346         5.00
      13.551     0.825000          357         5.71
      13.959     0.850000          368         6.67
      14.375     0.875000          378         8.00
      14.599     0.887500          384         8.89
      14.807     0.900000          389        10.00
      15.223     0.912500          395        11.43
      15.447     0.925000          400        13.33
      15.743     0.937500          405        16.00
      15.831     0.943750          408        17.78
      16.199     0.950000          411        20.00
      16.607     0.956250          414        22.86
      16.703     0.962500          416        26.67
      17.055     0.968750          419        32.00
      17.119     0.971875          420        35.56
      17.455     0.975000          422        40.00
      17.807     0.978125          423        45.71
      17.903     0.981250          424        53.33
      18.095     0.984375          426        64.00
      18.095     0.985938          426        71.11
      18.255     0.987500          427        80.00
      18.383     0.989062          428        91.43
      18.383     0.990625          428       106.67
      18.415     0.992188          429       128.00
      18.415     0.992969          429       142.22
      19.135     0.993750          430       160.00
      19.135     0.994531          430       182.86
      19.135     0.995313          430       213.33
      19.231     0.996094          431       256.00
      19.231     0.996484          431       284.44
      19.231     0.996875          431       320.00
      19.231     0.997266          431       365.71
      19.231     0.997656          431       426.67
      20.863     0.998047          432       512.00
      20.863     1.000000          432          inf
#[Mean    =        7.479, StdDeviation   =        4.642]
#[Max     =       20.848, Total count    =          432]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  530 requests in 1.03m, 0.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 157
Requests/sec:      8.55  
Transfer/sec:     14.90KB
AUTOTEST_DONE